app/views/portfolios/show.html.erb

      </table>
       <%= pie_chart @portfolio.stocks.group(:stock_symbol).count %>
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = ?  [["portfolio_id", 1]]
SELECT COUNT(*) AS count_all, stock_symbol AS stock_symbol FROM "stocks" WHERE "stocks"."portfolio_id" = ? GROUP BY stock_symbol  [["portfolio_id", 1]]