app/controllers/portfolios_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 5]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = ?  [["portfolio_id", 1]]
---
  def show
    @portfolio = Portfolio.find(params[:id])
    @stocks = @portfolio.stocks.group_by(&:stock_symbol)

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @portfolio = Portfolio.find(params[:id])

INSERT INTO "portfolios" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "new portfolio"], ["user_id", 0], ["created_at", "2015-05-06 17:09:59.000340"], ["updated_at", "2015-05-06 17:09:59.000340"]]
---
  def create
    @portfolio = Portfolio.new(portfolio_params)
    @portfolio.user = current_user
    @portfolio.save

DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 5]]
---
  def destroy
    @portfolio.destroy

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_portfolio
      @portfolio = Portfolio.find(params[:id])