app/controllers/stocks_controller.rb

  def create
    @stock = Stock.new(stock_params)
    @stock.save
---
INSERT INTO "stocks" ("stock_symbol", "portfolio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["stock_symbol", "aen"], ["portfolio_id", 8], ["created_at", "2015-05-11 17:10:30.515863"], ["updated_at", "2015-05-11 17:10:30.515863"]]

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", 11]]